#+INCLUDE: "../../../common/header.org"
#+TITLE: Capa de enlace
#+SUBTITLE: 
#+KEYWORDS: 
#+language: es


*** ¿Por qué CRC?
- Hay versiones de CRC para diferentes longitudes de polinomio: CRC16, CRC32,...
- Los errores se producen típicamente a ráfagas
- Para un CRC de $n$ bits
  - Se detectan todos los errores de ráfagas de menos de $n$ bits incorrectos
  - Se detecta una fracción de las ráfagas más largas ($1 - 2^{-n}$)

| Longitud de crc | Porcentaje de detección de ráfagas mayores |
|-----------------+--------------------------------------------|
|               8 |                                  99.609375 |
|              16 |                                  99.998474 |
|              32 |                           99.9999999767169 |
#+TBLFM: @2$2=100-100*2^(-@2$1)::@3$2=100-100*2^(-@3$1)

